<?php

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'المستخدمين',
            'قائمة المستخدمين',
            'إنشاء مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'أدوار المستخدمين',
            'اضافة الدور',
            'عرض الدور',
            'تعديل الدور',
            'حذف الدور',

            'صلاحيات المستخدمين',
            'اضافة صلاحية',
            'عرض صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'الحاويات',
            'ادخال بيانات الحاويات',
            'ادخال مصاريف الحاويات',

            'المنتجات',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',
            'ادخال نسبة الربح',

            'المخزن',
            'كشف المخزن',

            'المبيعات',
            'فاتورة المبيعات',
            'كشف المبيعات',

            'العملاء',
            'كشف تسديد العملاء',

            'الارجاع',
            'المصاريف',
            'كشف المصاريف',

            'كشف الارباح',

            'الاشعارات',
            'الاعدادات',

            /* 'الفواتير',
            'قائمة الفواتير',
            'تصدير EXCEL',
            'اضافة فاتورة',
            'تعديل الفاتورة',
            'ارشفة الفاتورة',
            'حذف الفاتورة',
            'طباعةالفاتورة',

            'التقارير',
            'تقرير الفواتير',
            'تقرير العملاء',

            'الاقسام',
            'اضافة قسم',
            'تعديل قسم',
            'حذف قسم', */
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
